imskriaz/IoT/firmware/espidf/esp32-s3-a7670e/docs/vendor/esp32-s3-a7670e/demo/Demo_V2_After_December_2025/ESP32-S3-A-SIM7670X-4G-V2/ESP-IDF/ESP32-S3-XXX7670X-4G-TCP/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_APP_UART_PORT_NUM=1
CONFIG_APP_UART_BAUD_RATE=115200
CONFIG_APP_UART_RXD=17
CONFIG_APP_UART_TXD=18
CONFIG_APP_UART_BUF_SIZE=1024
CONFIG_APP_RESPONSE_TIMEOUT_MS=2000
CONFIG_APP_TASK_STACK_SIZE=4096
